<template>
  <div class>
    <h5>WM钱包用户协议</h5>

    <p>
      <b>一、 定义</b>
      <br />1. 创建或导入钱包：指您使用WM钱包，确认履行本协议并创建或导入钱包的过程。
      <br />2. 钱包密码：指您在创建WM钱包钱包过程中，软件操作界面提示您填写的密码，该密码用于加密保护私钥。作为去中心化的应用，钱包密码不存储在您的这台移动设备或WM的服务器，一旦丢失你需要借助明文私钥或助记词恢复钱包。
      <br />3. 私钥：由256位随机字符构成，是用户拥有并使用数字代币的核心。
      <br />4. 公钥：由私钥借助密码学原理单向推导生成，并用以生成区块链数字钱包地址，数字钱包地址即为公开收款地址。
      <br />5. 助记词：符合区块链BIP39 行业标准，由随机算法生成的12（或15/18/21/24）个有序单词组成。是私钥的易记录表现形式，方便用户备份保管。
      <br />6. 数字代币：指WM钱包目前支持的数字代币种类，包括但不限于BTC、ETH等。
      <br /><b>二、 服务内容</b>
      <br />1. 创建或导入钱包。对WM钱包支持的数字代币，您可以使用WM钱包生成新钱包或导入相关区块链系统的其它钱包工具生成的兼容钱包。
      <br />2. 转账、收款。您可以使用WM钱包的转账、收款功能进行数字代币的管理，即运用私钥进行电子签名，对相关区块链的账本进行修改。转账是指付款方利用收款方的区块链地址进行转账操作，实际的转账、收款行为均在相关区块链系统（而非WM钱包）发生。
      <br />3. 行情查看。您可以使用WM钱包查看所提供的数字代币汇率价格。WM钱包通过抓取相应的数字代币汇率信息并展示在WM钱包中的“市场”版块。
      <br />4. 管理数字资产。您可以使用WM钱包添加、保管并移除WM钱包所支持的数字代币。
      <br />5. 交易记录。我们将通过区块链系统拷贝您全部或部分的交易记录。但交易记录以区块链系统的记载为准。
      <br /><b>三、 您的权利义务</b>
      <br />1.WM钱包暂时不向您收取任何形式的服务费或手续费，将来需对某些服务进行收费时将另行约定或公布规则；
      <br />2.您使用WM钱包进行转账时应支付矿工费，金额由您自行决定。矿工费由相关区块链系统收取；
      <br />3.您知悉在特定情况下，因为您所处的环境及网络状态不稳定，导致您的转账操作未完成时，亦会被相关区块链系统收取矿工费；
      <br />4.您因在WM钱包进行交易而发生的所有应纳税负及其它方面的费用均由您负责支付。
      <br /><b>四、 风险提示</b>
      <br />1. 您了解并知悉，由于数字代币领域的法律法规政策尚未健全，该领域的数字代币可能会产生无法兑现、技术不稳定等重大风险。且数字代币的价格波动幅度远高于其他金融资产。我们谨慎提醒您应当根据自身财务状况和风险偏好，理性选择持有或处置任何一种数字代币。WM钱包提供的行情查看功能仅系抓取部分交易所的数字代币汇率信息的搜索结果，并不表示为最新行情或最佳报价。
      <br />2. 在使用WM钱包服务时，若您或您的相对方未遵从本协议或相关网站说明、交易、支付页面中之操作提示、规则，WM钱包并不保证交易会顺利完成，且WM钱包不承担损害赔偿责任。若发生前述情形，而款项已先行入账您的或您的交易方的WM钱包钱包或第三方钱包，您理解区块链操作具有的“不可逆”属性，以及相关交易具有“不可撤销”的特征，由您及您的相对方自行承担相应的风险后果。
      <br />4. 您在交易过程中应当自行判断对方是否为完全民事行为能力人并自行决定是否与对方进行交易或转账给对方等，且您自行承担与此相关的所有风险。
      <br />5. 在转账过程中，如果出现“交易失败”、“打包超时”等类似的异常信息提示时，您应通过相关区块链系统的官方途径或其他的区块链查询工具进行再次确认，以避免重复转账；否则，由此所引起的一切损失和费用应由您自行承担。
      <br />6. 您理解当您在WM钱包上创建或导入钱包之后，您的Keystore、私钥、助记词等信息仅存储在当前的这台移动设备中，不存储在WM钱包或WM的服务器上。您可以按照WM钱包提供的操作指南采取同步钱包等方式更换移动设备。但若您未保存或备份钱包密码、私钥、助记词、Keystore等信息且在您移动设备丢失的情况下，您的数字代币将因此丢失，WM无法为您找回，您需自行承担相应损失。若您在导出、保存或备份钱包密码、私钥、助记词、Keystore等信息的时候泄密，或保存或备份上述信息的设备或服务器被黑客攻击或控制等情况下，您的数字代币将因此丢失，WM无法为您找回，您需自行承担相应损失。
      <br />7. 我们建议您在创建或导入钱包时对您钱包的钱包密码、私钥、助记词及Keystore等信息做好安全备份。我们提请您注意，请不要采用以下备份方式：截图、邮件、记事本、短信、微信、QQ等电子备份方式。我们建议您在纸质记事本上抄写助记词和Keystore等信息，同时您亦可将电子数据保管至密码管理器。
      <br />8. 我们建议您在安全的网络环境中使用WM钱包，确保您的移动设备没有越狱或Root， 以避免可能存在的安全隐患
      <br />9. 请您在使用我们的服务过程中，警惕非WM钱包官方的诈骗行为。一旦发现此类行为，我们鼓励您第一时间告知我们。
      <br /><b>五、 服务的变更、中断、终止</b>
      <br />1. 您同意WM为保证自主业务经营权可以暂时提供部分服务功能，或于将来暂停部分服务功能或开通新的服务功能。当任何功能减少或者增加或者变化时，只要您仍然使用WM提供的服务，表示您仍然同意本协议或者本协议修正后的条款。
      <br />2. 为保护您的数字代币安全，尽量避免您在不具备区块链基础知识的前提下使用WM钱包而产生的误操作或由此带来的风险，您必须先通过能力测评问卷并达到WM所要求的合格分数才能使用WM钱包服务，否则，WM有权限制或拒绝提供部分或全部的服务功能。
      <br />3. 您理解存在如下情形时，WM将暂停提供服务：
      <br />（1）因设备、区块链系统维修、升级、故障和通信中断等技术原因而中断业务；
      <br />（2）因台风、地震、海啸、洪水、停电、战争或恐怖袭击等不可抗力因素，病毒、木马、黑客攻击、系统不稳定或政府行为等原因，造成WM系统不能提供服务或WM合理认为继续提供服务会有较大风险的；
      <br />（3）发生WM无法控制或合理预见的其他情形。
      <br />3. 当您出现如下情况时，WM可单方面中止或终止您使用WM钱包的部分或全部功能:
      <br />（1）用户死亡；
      <br />（2）盗用他人的钱包信息或移动设备；
      <br />（3）填写个人信息时提供虚假信息、在回答能力测评问卷时非本人操作；
      <br />（4）拒绝WM为提升WM钱包功能而发起的强制更新操作；
      <br />（5）将WM钱包用于违法或犯罪活动；
      <br />（6）妨碍其他用户正常使用；
      <br />（7）伪称WM的工作人员或管理人员；
      <br />（8）攻击、侵入、更改或以任何其他方式威胁WM计算机系统的正常运作；
      <br />（9）利用WM钱包宣传垃圾广告；
      <br />（10）散布谣言，损害WM和WM钱包商誉；
      <br />（11）违法行为，其他违反本协议的行为，及WM合理认为应当暂停功能的情形。
      <br />4. 当您与WM之间的服务关系变更、中断、终止时，您仍有权在合理时间内导出您钱包等信息。
      <br /><b>六、 您合法使用WM服务的承诺</b>
      <br />1. 您应遵守中华人民共和国相关法律法规及您所居住的国家或地区的法律法规，不得将WM钱包用于任何非法目的，也不得以任何非法方式使用WM服务。
      <br />2. 您不得利用WM钱包从事违法或犯罪的行为，包括但不限于：
      <br />（1）反对宪法所确定的基本原则，危害国家安全、泄漏国家秘密、颠覆国家政权、破坏国家统一的；
      <br />（2）从事任何违法犯罪行为，包括但不限于洗钱、非法集资等；
      <br />（3）通过使用任何自动化程序、软件、引擎、网络爬虫、网页分析工具、数据挖掘工具或类似工具，接入WM服务、收集或处理WM所提供的内容，干预或试图干预任何用户或任何其他方式接入WM服务的行为；
      <br />（4）提供赌博资讯或以任何方式引诱他人参与赌博；
      <br />（5）侵入他人WM钱包钱包盗取数字代币；
      <br />（6）进行与交易对方宣称的交易内容不符的交易，或不真实的交易；
      <br />（7）从事任何侵害或可能侵害WM钱包服务系统、数据之行为；
      <br />（8）其他违法以及WM有正当理由认为不适当的行为。
      <br />3. 您理解并同意，如因您违反有关法律（包括但不限于海关及税务方面的监管规定）或者本协议之规定，使WM遭受任何损失、受到任何第三方的索赔或任何行政管理部门的处罚，您应对WM进行赔偿，包括合理的律师费用。
      <br />4. 您承诺按时缴纳WM的服务费用（如有），否则WM有权暂停或中止对您提供的服务。
      <br /><b>七、 免责及责任限制</b>
      <br />1. WM仅对本协议中所列明的义务承担责任。
      <br />2. 您理解和同意，在法律所允许的范围内，WM只能按照现有的技术水平和条件提供服务。因下列原因导致WM钱包无法正常提供服务，WM不承担责任：
      <br />（1）WM钱包系统停机维护或升级；
      <br />（2）因台风、地震、洪水、雷电或恐怖袭击等不可抗力原因；
      <br />（3）您的移动设备软硬件和通信线路、供电线路出现故障的；
      <br />（4）您操作不当或未通过WM授权或认可的方式使用WM服务的；
      <br />（5）因病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、通讯故障、电力故障、银行等原因或政府行为等原因；
      <br />（6）非因WM的原因而引起的任何其它原因。
      <br />3. WM对以下情形不承担责任：
      <br />（1）因用户遗失移动设备、删除且未备份WM钱包、删除且未备份钱包、钱包被盗或遗忘钱包密码、私钥、助记词、Keystore而导致的数字代币丢失；
      <br />（2）因用户自行泄露钱包密码、私钥、助记词、Keystore，或借用、转让或授权他人使用自己的移动设备或WM钱包钱包，或未通过WM官方渠道下载WM钱包应用程序或其他不安全的方式使用WM钱包应用程序导致的数字代币丢失；
      <br />（3）因用户误操作（包括但不限于您输错转账地址、您自身选择转账节点服务器的问题）导致的数字代币丢失；
      <br />（4）因用户不理解区块链技术的性质而进行误操作导致的数字代币丢失；
      <br />（5）因时间滞后、区块链系统不稳定等原因导致WM拷贝用户在区块链上的交易记录发生偏差；
      <br />（6）用户在第三方DApp上操作产生的风险和后果。
      <br />4. 您理解WM钱包仅作为您数字代币管理的工具。WM不能控制第三方DApp提供的产品及服务的质量、安全或合法性，信息的真实性或准确性，以及相对方履行其在与您签订的协议项下的各项义务的能力。所有您在第三方DApp进行的交易行为系您的个人行为，有约束力的合同关系在您和您的相对方之间建立，与WM钱包无关。WM提醒您应该通过自己的谨慎判断确定登录DApp及相关信息的真实性、合法性和有效性。您与任何第三方交易所产生的风险亦应由您自行承担。
      <br />5. WM可能同时为您及您的交易对手方提供服务，您同意对WM可能存在的该等行为予以明确豁免任何实际或潜在的利益冲突，并不得以此来主张WM在提供服务时存在法律上的瑕疵，也不因此而加重WM的责任或注意义务。
      <br />6. WM不提供以下形式的保证：
      <br />（1）WM服务将符合您的全部需求；
      <br />（2）您经由WM服务取得的任何技术、产品、服务、资讯将符合您的期望；
      <br />（3）WM从第三方交易所抓取的数字代币市场交易行情等信息的及时性、准确性、完整性、可靠性做出保证；
      <br />（4）您在WM钱包上的交易各方会及时履行其在与您达成的交易协议中各项义务。
      <br />7. 您理解WM钱包仅作为用户管理数字代币、显示交易信息的工具，WM不提供法律、税务或投资建议等服务。您应当自行向法律、税务、投资方面的专业人士寻求建议，且您在使用我们服务过程中所遭受的投资损失、数据损失等，WM概不负责。
      <br />8. 您理解根据有关中国政策法规的要求，我们可能不时更改我们的用户准入标准，限定向某一特定群体提供服务的范围和方式等。
      <br /><b>八、 法律适用与争议解决</b>
      <br />1. 本协议及其修订版之效力、解释、变更、执行与争议解决均适用中华人民共和国法律，如无相关法律规定，则应当适用国际商业惯例和（或）行业惯例。
      <br />2. 若您和WM之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，任何一方可提交WM所在地有管辖权的人民法院管辖。
      <br /><b>九、 其他</b>
      <br />1. 如您是中华人民共和国以外用户，您需全面了解并遵守您所在司法辖区与使用WM服务所有相关法律、法规及规则。
      <br />2. 您在使用WM服务过程中，如遇到任何问题，您可以通过在WM钱包提交反馈等方式联系我们。
      <br />3. 您可以在WM钱包中查看本协议。 WM鼓励您在每次访问WM钱包时都查阅WM的服务协议。
      <br />本协议未尽事宜，您需遵守WM不时更新的公告及相关规则。
      <br />
    </p>
  </div>
</template>

<script>
export default {
  data() {
    return {};
  },
};
</script>
